brew 'ack'
brew 'app-engine-go-64'
brew 'awscli'
brew 'ctags'
brew 'direnv'
brew 'ghq'
brew 'gist'
brew 'git'
brew 'go'
brew 'gpg2'
brew 'grc'
brew 'hub'
brew 'jq'
brew 'lesspipe'
brew 'nkf'
brew 'nodebrew'
brew 'peco'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'rbenv-ctags'
brew 'rbenv-default-gems'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby-build'
brew 'tig', args: ['with-docs']
brew 'tmux'
brew 'vim', args: ['with-luajit', 'with-python3']
brew 'yarn'
brew 'zsh', args: ['disble-etcdir']

tap 'neovim/neovim'
brew 'neovim'

tap 'caskroom/cask'

cask_args appdir: '/Applications'

# cask update
cask '1password'
cask 'alfred'
cask 'amazon-music'
cask 'android-file-transfer'
cask 'blisk'
cask 'cmd-eikana'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'hammerspoon'
cask 'insomniax'
cask 'iterm2'
cask 'jasper'
cask 'kindle'
cask 'kitematic'
cask 'sequel-pro'
cask 'skitch'
cask 'visual-studio-code'

# vim: filetype=ruby
