cask_args appdir: '/Applications'

brew 'ctags'
brew 'direnv'
brew 'fzf'
brew 'gist'
brew 'git'
brew 'gpg2'
brew 'grc'
brew 'jq'
brew 'lesspipe'
brew 'nodebrew'
brew 'peco'
brew 'pyenv'
brew 'rbenv'
brew 'rbenv-ctags'
brew 'rbenv-default-gems'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'tmux'
brew 'vim', args: ['with-lua', 'with-luajit', 'with-python3']
brew 'zsh', args: ['disble-etcdir']

tap 'caskroom/cask'

# cask update
cask '1password'
cask 'alfred'
cask 'dash'
cask 'dropbox'
cask 'docker'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'iterm2'
cask 'karabiner'
cask 'kitematic'
cask 'seil'
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'

# vim: filetype=ruby
