cask_args appdir: '/Applications'

brew 'direnv'
brew 'gh'
brew 'ghq'
brew 'git'
brew 'jq'
brew 'tig'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'pam-reattach'

# Zsh
brew 'starship'
brew 'fzf'
brew 'asdf'
brew 'zoxide'

# Neovim
brew 'neovim'
brew 'fd'
cask 'font-hack-nerd-font'
brew 'ripgrep'
brew 'tree-sitter-cli'

# For asdf-golang
brew 'coreutils'
# For asdf-nodejs
brew 'gpg'
brew 'gawk'


cask 'alfred'
cask 'ghostty'
cask 'hammerspoon'
cask 'visual-studio-code'
