brew 'awscli'
brew 'direnv'
brew 'fish'
brew 'ghq'
brew 'git'
brew 'hub'
brew 'jq'
brew 'nodebrew'
brew 'peco'
brew 'reattach-to-user-namespace'
brew 'tig', args: ['with-docs']
brew 'tmux'
brew 'yarn', args: ['without-node']
brew 'vim', args: ['with-luajit', 'with-python3']

tap 'neovim/neovim'
brew 'neovim'

cask_args appdir: '/Applications'
tap 'homebrew/cask'

cask '1password'
cask 'alfred'
cask 'cmd-eikana'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'hammerspoon'
cask 'iterm2'
cask 'skitch'
cask 'visual-studio-code'

mas "Quiver", id: 866773894

# vim: filetype=ruby
