brew 'awscli'
brew 'direnv'
brew 'ghq'
brew 'git'
brew 'jq'
brew 'peco'
brew 'reattach-to-user-namespace'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'yarn'

brew 'nodenv'
brew 'rbenv'
brew 'pyenv'

tap 'neovim/neovim'
brew 'neovim'

cask_args appdir: '/Applications'
tap 'homebrew/cask'

cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'skitch'
cask 'spotify'
cask 'visual-studio-code'
